micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_tim_ex.h
#define TIM_TIM5_TI1_GPIO                          0x00000000UL                                                   /*!< TIM5 TI1 is connected to GPIO */
#define TIM_TIM5_TI1_FDCAN_RTP                     TIM_TISEL_TI1SEL_1                                             /*!< TIM5_TI1 is connected to FDCAN RTP */
#define TIM_TIM5_TI1_FDCAN_TMP                     (TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)                      /*!< TIM5_TI1 is connected to FDCAN TMP */

#define TIM_TIM9_TI1_GPIO                          0x00000000UL                                                   /*!< TIM9 TI1 is connected to GPIO */
#define TIM_TIM9_TI1_MCO1                          TIM_TISEL_TI1SEL_2                                             /*!< TIM9 TI1 is connected to MCO1 */
#define TIM_TIM9_TI1_MCO2                          (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_0)                      /*!< TIM9 TI1 is connected to MCO2 */

#define TIM_TIM10_TI1_GPIO                         0x00000000UL                                                   /*!< TIM10_TI1 is connected to GPIO */
#define TIM_TIM10_TI1_I3C1_IBIACK                  TIM_TISEL_TI1SEL_0                                             /*!< TIM10_TI1 is connected to I3C1 IBI ACK */

#define TIM_TIM11_TI1_GPIO                         0x00000000UL                                                   /*!< TIM11_TI1 is connected to GPIO */
#define TIM_TIM11_TI1_I3C2_IBIACK                  TIM_TISEL_TI1SEL_0                                             /*!< TIM11_TI1 is connected to I3C2 IBI ACK */

#define TIM_TIM12_TI1_GPIO                         0x00000000UL                                                   /*!< TIM12 TI1 is connected to GPIO */
#define TIM_TIM12_TI1_SPDIF_FS                     TIM_TISEL_TI1SEL_0                                             /*!< TIM12 TI1 is connected to SPDIF FS */
#define TIM_TIM12_TI1_HSI_1024                     TIM_TISEL_TI1SEL_1                                             /*!< TIM12 TI1 is connected to HSI/1024 */
#define TIM_TIM12_TI1_MSI_128                      (TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)                      /*!< TIM12_TI1 is connected to MSI/128 */
#define TIM_TIM12_TI1_MCO1                         TIM_TISEL_TI1SEL_2                                             /*!< TIM12 TI1 is connected to MCO1 */
#define TIM_TIM12_TI1_MCO2                         (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_0)                      /*!< TIM12 TI1 is connected to MCO2 */

#define TIM_TIM13_TI1_GPIO                         0x00000000UL                                                   /*!< TIM13_TI1 is connected to GPIO */
#define TIM_TIM13_TI1_I3C1_IBIACK                  TIM_TISEL_TI1SEL_0                                             /*!< TIM13_TI1 is connected to I3C1 IBI ACK */

#define TIM_TIM14_TI1_GPIO                         0x00000000UL                                                   /*!< TIM14_TI1 is connected to GPIO */
#define TIM_TIM14_TI1_I3C2_IBIACK                  TIM_TISEL_TI1SEL_0                                             /*!< TIM14_TI1 is connected to I3C2 IBI ACK */

#define TIM_TIM15_TI1_GPIO                         0x00000000UL                                                   /*!< TIM15 TI1 is connected to GPIO */
#define TIM_TIM15_TI1_TIM2_CH1                     TIM_TISEL_TI1SEL_0                                             /*!< TIM15 TI1 is connected to TIM2 CH1 */
#define TIM_TIM15_TI1_TIM3_CH1                     TIM_TISEL_TI1SEL_1                                             /*!< TIM15 TI1 is connected to TIM3 CH1 */
#define TIM_TIM15_TI1_TIM4_CH1                     (TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)                      /*!< TIM15 TI1 is connected to TIM4 CH1 */
#define TIM_TIM15_TI1_MCO1                         TIM_TISEL_TI1SEL_2                                             /*!< TIM15 TI1 is connected to MCO1 */
#define TIM_TIM15_TI1_MCO2                         (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_0)                      /*!< TIM15 TI1 is connected to MCO2 */
#define TIM_TIM15_TI2_GPIO                         0x00000000UL                                                   /*!< TIM15 TI2 is connected to GPIO */
#define TIM_TIM15_TI2_TIM2_CH2                     TIM_TISEL_TI2SEL_0                                             /*!< TIM15 TI2 is connected to TIM2 CH2 */
#define TIM_TIM15_TI2_TIM3_CH2                     TIM_TISEL_TI2SEL_1                                             /*!< TIM15 TI2 is connected to TIM3 CH2 */
#define TIM_TIM15_TI2_TIM4_CH2                     (TIM_TISEL_TI2SEL_1 | TIM_TISEL_TI2SEL_0)                      /*!< TIM15 TI2 is connected to TIM4 CH2 */

#define TIM_TIM16_TI1_GPIO                         0x00000000UL                                                   /*!< TIM16 TI1 is connected to GPIO */
#define TIM_TIM16_TI1_LSI                          TIM_TISEL_TI1SEL_0                                             /*!< TIM16 TI1 is connected to LSI */
#define TIM_TIM16_TI1_LSE                          TIM_TISEL_TI1SEL_1                                             /*!< TIM16 TI1 is connected to LSE */
#define TIM_TIM16_TI1_RTC_WKUP                     (TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)                      /*!< TIM16 TI1 is connected to RTC wakeup interrupt */

#define TIM_TIM17_TI1_GPIO                         0x00000000UL                                                   /*!< TIM17 TI1 is connected to GPIO */
#define TIM_TIM17_TI1_SPDIF_FS                     TIM_TISEL_TI1SEL_0                                             /*!< TIM17 TI1 is connected to SPDIF FS */
#define TIM_TIM17_TI1_HSE_1024                     TIM_TISEL_TI1SEL_1                                             /*!< TIM17 TI1 is connected to HSE/1024 */
/**
  * @}
  */

/** @defgroup TIMEx_SMS_Preload_Enable TIM Extended Bitfield SMS preload enabling
  * @{
  */
#define TIM_SMS_PRELOAD_SOURCE_UPDATE     0x00000000U                            /*!< Prelaod of SMS bitfield is disabled */
#define TIM_SMS_PRELOAD_SOURCE_INDEX      TIM_SMCR_SMSPS                         /*!< Preload of SMS bitfield is enabled  */
/**
  * @}
  */

